package company.extendsDemo;

/*
方法覆盖重写的注意事项：
1. 必须保证父子类之间方法的名称相同，参数列表也相同。
@Override:写在方法前面，用来检测是不是有效的正确覆盖重写。
这个注释就算不写，只要满足要求，也是正确的方法覆盖重写。

2.子类方法的返回值必须小于等于父类方法的返回值范围。
java.lang.Object类是所有类的公共最高父类（祖宗类）
String有一个父类

3.子类方法的权限必须【大于等于】父类方法的权限修饰符
小扩展提示：public > protected > (default) > private
备注：（default）不是关键字default，而是什么都不写，留空。

 继承关系中，父子类构造方法的访问特点：

 1.子类构造方法当中又一个默认隐含的"super()"调用，所以一定是先调用的父类构造，后执行的子类构造
 2.子类构造可以通过super关键字来调用父类重载构造
 3.super的父类构造调用，必须是子类构造方法的第一个语句，不能一个子类构造调用多次super构造
 4.子类必须调用父类构造方法


 */
public class Demo01Override {
}
